-- Скрипт сгенерирован Devart dbForge Studio for MySQL, Версия 5.0.97.1
-- Домашняя страница продукта: http://www.devart.com/ru/dbforge/mysql/studio
-- Дата скрипта: 18.12.2012 10:24:55
-- Версия сервера: 5.1.66-community-log
-- Версия клиента: 4.1

-- 
-- Отключение внешних ключей
-- 
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;

-- 
-- Установка кодировки, с использованием которой клиент будет посылать запросы на сервер
--
SET NAMES 'utf8';

-- 
-- Установка базы данных по умолчанию
--
USE noticeboard_1;

--
-- Описание для таблицы nb_categories
--
DROP TABLE IF EXISTS nb_categories;
CREATE TABLE nb_categories (
  id INT(10) NOT NULL AUTO_INCREMENT,
  name VARCHAR(150) NOT NULL,
  parent INT(11) NOT NULL,
  sort INT(11) NOT NULL,
  left_key INT(10) NOT NULL DEFAULT 0,
  right_key INT(10) NOT NULL DEFAULT 0,
  level INT(10) NOT NULL DEFAULT 0,
  PRIMARY KEY (id),
  INDEX left_key (left_key, right_key, level)
)
ENGINE = INNODB
AUTO_INCREMENT = 59
AVG_ROW_LENGTH = 282
CHARACTER SET utf8
COLLATE utf8_general_ci;

--
-- Описание для таблицы nb_users
--
DROP TABLE IF EXISTS nb_users;
CREATE TABLE nb_users (
  id INT(11) NOT NULL AUTO_INCREMENT,
  email VARCHAR(255) NOT NULL,
  `password` VARCHAR(255) NOT NULL,
  updated_at TIMESTAMP DEFAULT '0000-00-00 00:00:00' ON UPDATE CURRENT_TIMESTAMP,
  created_at TIMESTAMP DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (id),
  UNIQUE INDEX email (email)
)
ENGINE = INNODB
AUTO_INCREMENT = 2
AVG_ROW_LENGTH = 16384
CHARACTER SET utf8
COLLATE utf8_general_ci;

-- 
-- Вывод данных для таблицы nb_categories
--
INSERT INTO nb_categories VALUES 
  (1, 'Транспорт', 0, 1, 0, 0, 0),
  (2, 'Недвижимость', 0, 2, 0, 0, 0),
  (3, 'Личные вещи', 0, 5, 0, 0, 0),
  (4, 'Для дома и дачи', 0, 3, 0, 0, 0),
  (5, 'Бытовая электроника', 0, 4, 0, 0, 0),
  (6, 'Хобби и отдых', 0, 7, 0, 0, 0),
  (7, 'Животные', 0, 8, 0, 0, 0),
  (8, 'Работа и бизнес', 0, 6, 0, 0, 0),
  (9, 'Автомобили с пробегом', 1, 0, 0, 0, 0),
  (10, 'Новые автомобили', 1, 0, 0, 0, 0),
  (11, 'Мотоциклы и мототехника', 1, 0, 0, 0, 0),
  (12, 'Грузовики и спецтехника', 1, 0, 0, 0, 0),
  (13, 'Водный транспорт', 1, 0, 0, 0, 0),
  (14, 'Запчасти и аксессуары', 1, 0, 0, 0, 0),
  (15, 'Квартиры', 2, 0, 0, 0, 0),
  (16, 'Комнаты', 2, 0, 0, 0, 0),
  (17, 'Дома, дачи, коттеджи', 2, 0, 0, 0, 0),
  (18, 'Земельные участки', 2, 0, 0, 0, 0),
  (19, 'Гаражи и машиноместа', 2, 0, 0, 0, 0),
  (20, 'Коммерческая недвижимость', 2, 0, 0, 0, 0),
  (21, 'Недвижимость за рубежом', 2, 0, 0, 0, 0),
  (22, 'Одежда, обувь, аксессуары', 3, 0, 0, 0, 0),
  (23, 'Детская одежда и обувь', 3, 0, 0, 0, 0),
  (24, 'Товары для детей и игрушки', 3, 0, 0, 0, 0),
  (25, 'Часы и украшения', 3, 0, 0, 0, 0),
  (26, 'Красота и здоровье', 3, 0, 0, 0, 0),
  (27, 'Бытовая техника', 4, 0, 0, 0, 0),
  (28, 'Мебель и интерьер', 4, 0, 0, 0, 0),
  (29, 'Посуда и товары для кухни', 4, 0, 0, 0, 0),
  (30, 'Ремонт и строительство', 4, 0, 0, 0, 0),
  (31, 'Растения', 4, 0, 0, 0, 0),
  (32, 'Аудио и видео', 5, 0, 0, 0, 0),
  (33, 'Игры, приставки и программы', 5, 0, 0, 0, 0),
  (34, 'Настольные компьютеры', 5, 0, 0, 0, 0),
  (35, 'Ноутбуки', 5, 0, 0, 0, 0),
  (36, 'Оргтехника и расходники', 5, 0, 0, 0, 0),
  (37, 'Планшеты и электронные книги', 5, 0, 0, 0, 0),
  (38, 'Телефоны', 5, 0, 0, 0, 0),
  (39, 'Товары для компьютера', 5, 0, 0, 0, 0),
  (40, 'Фототехника', 5, 0, 0, 0, 0),
  (41, 'Билеты и путешествия', 6, 0, 0, 0, 0),
  (42, 'Велосипеды', 6, 0, 0, 0, 0),
  (43, 'Книги и журналы', 6, 0, 0, 0, 0),
  (44, 'Коллекционирование', 6, 0, 0, 0, 0),
  (45, 'Музыкальные инструменты', 6, 0, 0, 0, 0),
  (46, 'Охота и рыбалка', 6, 0, 0, 0, 0),
  (47, 'Спорт и отдых', 6, 0, 0, 0, 0),
  (48, 'Знакомства', 6, 0, 0, 0, 0),
  (49, 'Собаки', 7, 0, 0, 0, 0),
  (50, 'Кошки', 7, 0, 0, 0, 0),
  (51, 'Птицы', 7, 0, 0, 0, 0),
  (52, 'Аквариум', 7, 0, 0, 0, 0),
  (53, 'Другие животные', 7, 0, 0, 0, 0),
  (54, 'Товары для животных', 7, 0, 0, 0, 0),
  (55, 'Работа', 8, 0, 0, 0, 0),
  (56, 'Услуги', 8, 0, 0, 0, 0),
  (57, 'Оборудование для бизнеса', 8, 0, 0, 0, 0),
  (58, 'Продукты питания', 8, 0, 0, 0, 0);

-- 
-- Вывод данных для таблицы nb_users
--
INSERT INTO nb_users VALUES 
  (1, 'serovvitaly@gmail.com', '$2a$08$D1iMcwxqERfwvznzJ2FfyuYDHOgD3N/b7u1hyWFtVvuVYxfe2XP1m', '2012-12-18 04:11:47', '2012-12-18 04:11:47');

-- 
-- Включение внешних ключей
-- 
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;